# Languages
language_ru = Русский
language_en = Английский
language_uk = Українська

# Common buttons
button_back = Назад
button_cancel = Отменить
button_close = Закрыть
button_delete = Удалить
button_donation = Донат
button_support = Поддержка
button_download = Скачать
button_about = О проекте
button_faq = Часто задаваемые вопросы
button_limits = Лимиты
button_select_language = Выбор языка
button_subscription = Подписка
button_yes_delete = Да, удалить

shared_message_about = <b>💡 О проекте</b>

    Этот проект развивается благодаря усилиям программиста, а также поддержке профессионалов из разных областей. Команда включает знакомых SMM специалистов, видеомонтажеров и людей, работающих в соцсетях, которые активно используют наших ботов и помогают с советами и улучшениями. 🤝

    Наши боты созданы для решения самых разных задач:

    - 🎶 <b>{$musicSearchBotUsername}</b> — Муз-бот для поиска музыки, чтобы находить любые треки.
    
    - 📥 <b>{$downloaderBotUsername}</b> — Бот для скачивания медиа из соцсетей (Instagram, TikTok, YouTube) и мессенджеров.
    
    - 🎬 <b>{$vttBotUsername}</b> — Бот для преобразования видео и аудио в текст.
    
    - 🎨 <b>{$tiktokVideosBotUsername}</b> — Бот для создания креативных видео для TikTok.
    
    - 📝 <b>{$videoCaptionsBotUsername}</b> — Бот для сторитейлинга, который превращает ваш текст в аудио и накладывает субтитры на видео.

    Каждый из нас вносит свою лепту, чтобы сделать ботов еще удобнее и полезнее для вас! 💡💬

shared_message_support = <b>🚨 Возникли трудности?</b>

    Мы всегда рады помочь вам! 😊 Если у вас возникли вопросы по работе с ботами, какие-то сложности или пожелания — не стесняйтесь писать нам! 💬 
    
    Просто напишите {$supportUsername}, и мы обязательно вам поможем! 🤝💡

shared_message_language_settings = <b>🌍 Выбор языка</b>

    Выберите язык, на котором вы хотите общаться с ботом. 
    Мы поддерживаем несколько языков, чтобы обеспечить удобство использования для всех пользователей.

    Просто выберите нужный язык, и я продолжу работать с вами на этом языке! 🎉


shared_error_limits_reached = <b>😞 Вы достигли бесплатного лимита</b>

    К сожалению, вы исчерпали свой бесплатный лимит на сегодня, и у вас нет подписки. 
    
    Чтобы продолжить использовать ботов без ограничений, оформите подписку в боте {$billingBotUsername}.
    Подписка откроет вам неограниченный доступ к функционалу ботов! 🎉


shared_message_subscription = <b>🎉 Подписка на ботов!</b>

    Подписка дает вам доступ сразу к трем ботам на 30 дней! 🚀

    С подпиской вы получаете:
    - Доступ к боту для скачивания медиа из социальных сетей (Instagram, TikTok, YouTube) без ограничений!
    - Доступ к боту для поиска музыки с Spotify без лимитов!
    - Доступ к боту для преобразования видео/аудио в текст без ограничений!

    Теперь вы можете скачивать видео и музыку, искать треки и преобразовывать аудио/видео в текст без ограничений и лимитов! 🎶📹✍️

    Подписка позволит вам наслаждаться полным функционалом всех ботов, без ограничений по количеству загрузок, запросов и преобразований.

    Не упустите возможность — получите подписку и используйте ботов на полную мощность! 🎉

    Чтобы оформить подписку, перейдите в {$billingBotUsername} по ссылке и следуйте инструкциям.

# ============================ BILLING ============================
billing_button_ask_donation = 💖 Поддержать ботов
billing_button_ask_subscription = 📅 Оформить подписку

# Donation invoice
billing_donation_title = Поддержать развитие ботов
billing_donation_label = Одноразовая помощь
billing_donation_description = На кофе и успокоительное для разработчиков
billing_message_donation = <b>Помогите нам развивать ботов!</b>

    Боты созданы благодаря усилиям команды разработчиков, которые вкладывают свою энергию и время в улучшение функционала. 
    Мы постоянно работаем над новыми возможностями, и ваша поддержка помогает нам двигаться вперед. 
    
    Ваш донат даст нам возможность улучшить работу ботов, добавлять новые функции и обеспечивать их стабильность. 
    Каждая ваша помощь важна для нас! 🙏💖

billing_donation_thanks = <b>Спасибо за вашу помощь!</b>

    Ваша поддержка очень важна для нас, и мы благодарны за вклад в наш проект. 
    Каждое ваше пожертвование помогает нам сделать ботов лучше, быстрее и полезнее.
    
    С вашей помощью мы сможем добавлять новые функции и улучшать работу ботов! 🎉🙏

# Main messages and errors
billing_error_unknown_payment = <b>❗ Неизвестный платёж</b>

    К сожалению, мы не можем обработать этот платёж, так как он не соответствует ни подписке, ни донату. 
    
    Пожалуйста, свяжитесь с поддержкой, чтобы разобраться в ситуации. Мы обязательно поможем вам! 🤔

billing_message_start = <b>👋 Привет!</b>

    Этот бот предоставляет подписку на доступ к трём нашим сервисам:

    1. 🎶 <b>Муз-бот для поиска музыки</b> — ищите и находите любые музыкальные треки прямо здесь! {$musicSearchBotUsername}

    2. 📥 <b>Бот для скачивания медиа из соцсетей</b> — скачивайте видео и аудио из популярных социальных сетей и мессенджеров. {$downloaderBotUsername}

    3. 🎬 <b>Бот для преобразования видео/аудио в текст</b> — преобразуйте видео и аудио файлы в текст с помощью нашего бота. {$vttBotUsername}

    Подпишитесь, чтобы пользоваться всеми функциями наших ботов!


# Subscription invoice
billing_subscription_description = Безлимитный доступ к ботам проекта на 30 дней
billing_subscription_label = Доступ к ботам
billing_subscription_title = Подписка на ботов
billing_message_subscription= <b>🔄 Подписка</b>

    Оформив подписку, вы получаете доступ ко всем возможностям ботов на 30 дней, а также поддерживаете наш проект. 
    
    Оплата будет осуществляться через Telegram Stars 🌟. 
    Благодаря вам мы можем развивать проект и добавлять новые фичи!

billing_subscription_thanks = <b>Спасибо за подписку!</b>

    Теперь у вас есть доступ ко всем функциям наших ботов! 
    Вы поддерживаете развитие проекта, и мы искренне благодарны за вашу помощь. 
    Вместе мы сделаем наших ботов еще лучше! 🚀🎶📥

billing_message_faq = <b>❓ Часто задаваемые вопросы (FAQ)</b>

    <b>1. К каким ботам дает доступ подписка?</b>
    Подписка дает вам неограниченный доступ ко всем ботам нашей команды, включая:
    - {$downloaderBotUsername} - Бот для скачивания медиа из социальных сетей (Instagram, TikTok, YouTube).
    - {$musicSearchBotUsername} - Бот для поиска музыки.
    - {$vttBotUsername} - Бот для преобразования аудио/видео в текст.

    <b>2. Сколько стоит подписка?</b>
    Стоимость подписки — ⭐{$billingBotSubscriptionPrice} Telegram Stars за 30 дней с момента оформления.

    <b>3. Будет ли автоматически сниматься оплата?</b>
    Нет, оплата в Telegram не поддерживает автоматические списания. Однако, наш бот заранее уведомит вас о дате окончания подписки, чтобы вы могли продлить ее.

    <b>4. На какие сервисы не распространяется подписка?</b>
    Подписка не дает доступа к следующим сервисам:
    - {$tiktokVideosBotUsername} - Бот для создания видео для TikTok.
    - {$videoCaptionsBotUsername} - Бот для сторитейлинга, который преобразует ваш текст в аудио и накладывает субтитры на различные видео.

    <b>5. Как узнать о статусе подписки?</b>
    Вы можете проверить статус своей подписки, написав в {$billingBotUsername}, и бот предоставит актуальную информацию.


# ============================ DOWNLOADER ============================
downloader_button_go = Начать
downloader_error_no_info = <b>😕 Не удалось найти медиафайлы</b>

    По предоставленной ссылке не удалось найти медиафайлы для скачивания.
    Пожалуйста, проверьте правильность ссылки и попробуйте снова.

downloader_incorrect_social_link = <b>⚠️ Неподдерживаемая социальная сеть</b>

    Вы отправили ссылку на сервис, который не поддерживается ботом.
    
    Пожалуйста, отправьте ссылку с Instagram, TikTok, YouTube или Spotify.

downloader_label_author = Автор
downloader_label_duration = Длительность
downloader_label_quality = Качество
downloader_label_size = Размер
downloader_label_source = Источник
downloader_label_title = Описание
downloader_label_type = Тип медиа
downloader_label_url = Ссылка

downloader_type_image = Картинка
downloader_type_video = Видео
downloader_type_audio = Аудио

downloader_message_large_video = <b>🛑 Файл слишком большой</b>
    
    К сожалению, файл слишком большой, и бот не может его отправить.
    
    Воспользуйтесь прямыми ссылками которые предоставил вам бот 

downloader_message_start = <b>👋 Привет!</b>
    Этот бот позволяет скачивать видео из TikTok, Instagram, YouTube
    и музыку с Spotify. Просто отправьте ссылку на медиа, чтобы начать загрузку!
    Наслаждайтесь! 🎶📹

downloader_message_faq = <b>❓ Часто задаваемые вопросы (FAQ)</b>

    <b>1. Как начать скачивание?</b>
    Нажмите кнопку <b>🚀 Начать</b> и отправьте ссылку на видео или трек из Instagram, TikTok, YouTube или Spotify.

    <b>2. Почему бот не нашел медиафайлы?</b>
    Если бот сообщает "<b>😕 Не удалось найти медиафайлы</b>", проверьте, что ссылка ведет на страницу с медиафайлом и попробуйте снова. Иногда формат ссылки может быть неподходящим.

    <b>3. Поддерживаются ли другие социальные сети?</b>
    Бот поддерживает только Instagram, TikTok, YouTube и Spotify. Если вы отправите ссылку с других сервисов, появится сообщение "<b>⚠️ Неподдерживаемая социальная сеть</b>".

    <b>4. Что делать, если файл слишком большой?</b>
    В случае, если бот не может отправить файл, он отобразит сообщение "<b>🛑 Файл слишком большой</b>". Проверьте, есть ли у вас доступ к прямой ссылке.

    <b>5. Какую информацию о файле предоставляет бот?</b>
    Бот может показать следующую информацию о файле:
    - <b>Автор</b> (если доступен)
    - <b>Длительность</b> видео или аудио
    - <b>Качество</b> (разрешение видео)
    - <b>Размер</b> файла
    - <b>Источник</b> (Instagram, YouTube, TikTok или Spotify)
    - <b>Описание</b> и <b>Тип медиа</b>

    <b>6. Как связаться с поддержкой?</b>
    Если у вас возникли вопросы или трудности, не стесняйтесь обращаться к поддержке. Мы всегда готовы помочь!

downloader_message_limits = <b>⏳ Ограничение на использование</b>

    Без подписки вы можете использовать бота, но существует лимит — обработка до {$downloaderBotLimit} ссылок в день. 

    Чтобы снимать ограничения и наслаждаться неограниченным доступом, оформите подписку! 🎉

downloader_message_go = <b>📥 Отправьте ссылку для загрузки</b>

    Чтобы начать, просто отправьте ссылку на видео из Instagram, TikTok, YouTube или на песню из Spotify. Бот обработает её и предложит варианты загрузки. 🚀

# ============================ MUSIC SEARCH ============================
music_search_button_go = Начать

music_search_error_sending_audio = <b>😕 Боту не удалось отправить аудио</b>
    К сожалению, возникла ошибка при отправке трека. Пожалуйста, попробуйте еще раз позже.

music_search_message_sending_audio = <b>🎶 Бот начал отправку трека...</b>

    Ваш трек уже отправляется! Пожалуйста, подождите немного.

music_search_message_start = <b>👋 Привет!</b>
    
    Я — ваш надежный помощник в мире музыки! 🎧

    Я помогу вам найти и скачать вашу любимую музыку. 
    Просто отправьте название трека или имя исполнителя, и я начну поиск!

music_search_message_tracks_not_found = <b>:( Ой, ничего не найдено</b>
    
    К сожалению, я не смог найти трек по вашему запросу. Попробуйте ввести название или имя исполнителя еще раз.

music_search_message_tracks_result = <b>🎉 Ура! Вот что я нашел!</b>
    
    Я нашел несколько треков по вашему запросу. Наслаждайтесь прослушиванием!

music_search_message_faq = <b>❓ Часто задаваемые вопросы (FAQ)</b>

    <b>1. Как начать поиск музыки?</b>
    Просто отправьте название трека или имя исполнителя, и я начну поиск для вас.

    <b>2. Что делать, если я не могу найти трек?</b>
    Если я не смог найти трек, возможно, запрос не совсем точный. Попробуйте изменить название или исполнителя и попробуйте снова.

    <b>3. Сколько треков я могу искать в день?</b>
    Без подписки вы можете искать только {$musicSearchBotLimit} трека в день. Для неограниченного поиска оформите подписку!

music_search_message_limits = <b>⏳ Ограничение на использование</b>

    Без подписки вы можете воспользоваться ботом только {$musicSearchBotLimit} раза в день({$musicSearchBotLimit} поиска). 
    
    Если вам нужно больше, оформите подписку и наслаждайтесь неограниченным доступом к музыке! 🎶

music_search_message_go = <b>🔍 Отправьте название трека или имя исполнителя</b>
    Чтобы начать, просто отправьте название песни или имя исполнителя, и я начну поиск! 🎵

music_search_bot_start_search = 
    🔍 <b>Бот начал поиск треков!</b> 🎶 
    
    Мы отправим их вам, как только найдём! ⏳

# ============================ VTT ============================
vtt_button_go = Начать

vtt_message_fetching_audio = <b>📥 Мы получили ваше видео!</b>
    Теперь извлекаем аудио для преобразования в текст. Пожалуйста, подождите.

vtt_message_processing_audio = <b>🎧 Преобразуем аудио в текст...</b>
    Бот начал процесс преобразования аудио в текст. Скоро у вас будет результат!

vtt_message_start = <b>👋 Привет!</b>
    Я — бот для преобразования аудио и видео в текст! 🎤🎬

    Вы можете отправить мне:
    - Видео файл
    - Аудио файл
    - Голосовое сообщение
    - Видео-сообщение (кружок / video note)

    Я извлеку из этих файлов текст и отправлю вам результат!

vtt_message_faq = <b>❓ Часто задаваемые вопросы (FAQ)</b>
    
    <b>1. Как отправить файл для преобразования в текст?</b>
    Просто отправьте мне видео, аудио файл или голосовое/видео сообщение, и я начну процесс преобразования.

    <b>2. Как долго длится преобразование?</b>
    Обычно это занимает всего несколько секунд! ⏱️

    <b>3. Какие лимиты на использование?</b>
    Без подписки вы можете обработать только {$vttBotLimit} файла в день. Для неограниченного доступа оформите подписку!

vtt_message_limits = <b>⏳ Ограничения на использование</b>
    Без подписки вы можете обрабатывать только {$vttBotLimit} файла в день (трека или видео). 
    Оформите подписку и получите безграничный доступ ко всем возможностям бота и других ботов!

vtt_message_go = <b>🔊 Отправьте аудио, видео или запишите голосовое/видео сообщение</b>
    Для начала отправьте мне файл или записывайте сообщение, и я преобразую его в текст! 🎙️

vtt_error_processing = <b>😞 Ошибка обработки файла</b>

    К сожалению, не удалось обработать загруженный файл. 
    
    Мы уведомили разработчиков, и они уже работают над устранением проблемы. 
    Пожалуйста, попробуйте снова позже.

# ============================ TIKTOK VIDEOS ============================
tiktok_videos_button_process_video = Обработать
tiktok_videos_button_back_editor = Назад к редактору
tiktok_videos_button_template = Шаблон
tiktok_videos_button_backdrop = Фон
tiktok_videos_button_sound_settings = Звук
tiktok_videos_button_position = Позиция
tiktok_videos_button_ratio = Соотношение
tiktok_videos_button_upload_large_video = Загрузить
tiktok_videos_button_go = Редактировать
tiktok_videos_button_close_editor = Закрыть редактор
tiktok_videos_button_template_split = Split
tiktok_videos_button_template_popup = Popup
tiktok_videos_button_open_result_video = Открыть видео

tiktok_videos_position_top = Сверху
tiktok_videos_position_center = По центру
tiktok_videos_position_bottom = Внизу

tiktok_videos_error_no_editor =
    ❌ Редактор не открыт.
    Пожалуйста, загрузите видео для начала.
tiktok_videos_error_audio_long_duration =
    🚫 Ошибка: аудио слишком длинное.
    Загрузите файл с меньшей длительностью.
tiktok_videos_error_opened_editor =
    ⚠️ Редактор уже открыт.
    Завершите текущий процесс редактирования или закройте редактор.
tiktok_videos_error_video_duration =
    ⏰ Ошибка: длительность видео некорректна.
    Проверьте длительность и попробуйте снова.
tiktok_videos_error_file_too_big =
    📁 Файл слишком большой.
    Пожалуйста, загрузите файл меньшего размера.
tiktok_videos_error_file_upload_error =
    ❗ Ошибка загрузки файла.
    Попробуйте загрузить файл еще раз.
tiktok_videos_error_url_host =
    🌐 Ошибка ссылки: допускаются только ссылки с серверов бота.
tiktok_videos_error_photo_not_implemented =
    🖼️ Фотографии не поддерживаются.
    Загрузка фотографий для обработки пока недоступна.
tiktok_videos_error_no_backdrop_video =
    🎥 Фоновое видео не выбрано.
    Выберите фоновое видео для продолжения.
tiktok_videos_error_video_url =
    🔗 Видео по указанному URL не найдено.
    Проверьте адрес и попробуйте снова.

tiktok_videos_message_start= 
    <b>Добро пожаловать в TgTok</b> — твой личный помощник по созданию крутых TikTok видео! 🎬🔥 

    Здесь ты можешь легко создать видео с двумя шаблонами на выбор: 
    - <b>Split view</b> — экран разделен на две части 📱⬆️⬇️. 
    - <b>Popup</b> — основное видео по центру с фоном на заднем плане 🎥✨. 
    
    <b>Как начать:</b> 
    1. Загрузите своё видео 🎥. 
    2. Выбери шаблон: Split view или Popup 📊. 
    3. Определи тематику для фона: Minecraft 🏰, GTA Parkour 🚗💥, Приготовление еды 🍳, или Уборка/очистка ковров 🧹🧼. 
    4. Настройте видео ⚙️ - добавьте собственное аудио, дополнительное видео, соотношение сторон. 
    5. Получи готовое видео в несколько кликов и наслаждайся результатом! 🎉🚀 
    Если что-то непонятно — всегда пиши /help. <b>Я здесь, чтобы помочь!</b> 😉

tiktok_videos_message_faq= 
    🤔 <b>Что такое TgTok?</b>
    TgTok — это твой личный помощник по созданию удивительных TikTok видео! 🎬✨ 
    С нашим ботом ты можешь легко загружать видео, выбирать шаблоны и настраивать свой контент. 🚀 
    
    💰 <b>Сколько бесплатных видео я могу создать?</b>
    Ты можешь создавать до <b>{$tiktokVideosBotLimit} видео каждый день бесплатно!</b> 🎉 
    После этого можно приобрести дополнительные видео на основе их длительности всего за <b>{$tiktokVideosBotPricePerMinute} звезд Telegram за минуту.</b> ⭐ 
    
    🎥 <b>Какие шаблоны доступны?</b>
    Мы предлагаем два увлекательных шаблона: <b>Split view</b> (разделенный экран) 📱⬆️⬇️ и <b>Popup</b> (основное видео с фоном) 🎥✨. 
    Выбери тот, который подходит тебе! 
    
    🔊 <b>Могу ли я добавить своё аудио?</b>
    Абсолютно! Ты можешь загрузить своё аудио и настроить громкость для своих видео. 🎧 
    Сделай свои творения по-настоящему уникальными! 🎵 
    
    ⏳ <b>Сколько времени занимает обработка видео?</b>
    Обработка видео происходит в реальном времени! ⏱️ 
    Ты будешь получать обновления о прогрессе, и твоё видео будет готово вскоре. 🚀

tiktok_videos_message_editor_ratio= 
    <b>Настройки соотношения сторон видео</b> ⚙️ 
    
    Вы открыли настройки соотношения сторон для основного видео и фонового видео! Здесь вы можете настроить размеры между двумя видео: 
    
    1. <b>50% / 50%</b> 📏⚖️: Одинаковые размеры для основного видео и фона, создавая сбалансированный вид. 
    2. <b>25% / 75%</b> 📏📽️: Основное видео занимает меньшую часть, в то время как фоновое видео доминирует на экране. 
    3. <b>75% / 25%</b> 📏🎥: Основное видео больше, что обеспечивает более заметное отображение на фоне меньшего видео. 
    
    Выберите предпочтительное соотношение, чтобы настроить макет вашего видео!

tiktok_videos_message_editor_backdrop= 
    <b>Выбери тему фонового видео</b>: 

    - <b>Minecraft</b> 🏰 
    - <b>GTA Parkour</b> 🚗💥 
    - <b>Приготовление еды</b> 🍳 
    - <b>Уборка/чистка ковров</b> 🧹🧼 

tiktok_videos_message_editor_sound_settings = 
    <b>Настройки аудио</b> 🎧 
    Настрой <b>громкость каждого элемента видео</b> по своему вкусу: 

    1. <b>Громкость главного видео</b> 📽️: {$editorMainVideoVolume}% 
    2. <b>Громкость фонового видео</b> 🖼️: {$editorBackdropVideoVolume}% 
    3. <b>Громкость пользовательского аудио</b> 🎤: {$editorCustomAudioVolume}% 

    Используй <b>ползунки</b> для тонкой настройки звука, чтобы всё звучало <b>идеально</b>! 🎛️

tiktok_videos_message_editor_vertical_position = 
    <b>Настройки положения видео</b> ⚙️ 

    Вы открыли настройки <b>положения основного видео</b>! Здесь вы можете выбрать, где хотите разместить основное видео в своем проекте. 

    1. <b>Сверху</b> 📱⬆️: Разместите основное видео в верхней части экрана для <b>более яркого отображения</b>. 

    2. <b>По центру</b> 📱🎯: Поместите основное видео по центру для <b>сбалансированного вида</b>.
    <i>Эта опция недоступна в режиме Split view!</i>

    3. <b>Внизу</b> 📱⬇️: Разместите основное видео внизу, чтобы сосредоточить внимание на фоне. 

    Выберите предпочтительный вариант, чтобы <b>настроить макет вашего видео</b>!

tiktok_videos_message_editor_templates_info = 
    <b>Выбери шаблон, который тебе больше нравится:</b> 
    
    - <b>Split view</b> — разделение экрана на две части 📱⬆️⬇️. 
    
    - <b>Popup</b> — основное видео по центру с фоном на заднем плане 🎥✨. 
    
    Нажми на одну из кнопок ниже, чтобы продолжить! ⬇️

tiktok_videos_message_limits = 
    <b>💼 Ежедневная квота:</b> 

    Вы можете бесплатно создать до <b>{$tiktokVideosBotLimit} видео в день</b> — отличный способ начать! 🆓✨ 

    После этого за каждое следующее видео взимается плата <b>{$tiktokVideosBotPricePerMinute} Telegram Stars</b> 🌟 за минуту видео ⏱ (минимальная плата — <b>${$tiktokVideosBotPricePerMinute} звёзд</b>). 

    Чем больше создаёте, тем больше можно делиться! 😎

tiktok_videos_message_video_processing_progress = 
    ⏳ <b>Ваше видео обрабатывается!</b> 🎬 
    Мы добавляем последние штрихи, чтобы сделать его идеальным! 🔧

    <b>Текущий прогресс:</b> {$progress}% 🔄

    Пожалуйста, подождите, это может занять некоторое время... ⚡

    Вы получите уведомление, как только оно будет готово! 🎉

tiktok_videos_message_start_video_processing = 
    ⚙️ <b>Ваше видео в очереди!</b> 🎬 
    Наша система обрабатывает всё автоматически в режиме реального времени. 
    Не переживайте, мы будем держать вас в курсе! ⏳
    
    Расслабьтесь и дайте магии свершиться! ✨

tiktok_videos_message_paid_video_result = 
    🎉 <b>Огромное спасибо за оплату!</b> 🥳 

    Ваше видео успешно обработано и готово к использованию! 📹✨ 
    
    Оно доступно по ссылке ниже — можете делиться с друзьями или использовать по своему усмотрению! 😎 
    Если понадобится помощь, мы всегда рядом! 💬

tiktok_videos_message_language_settings = 
    🌍 <b>Выберите язык</b> 🌐 

    Пожалуйста, выберите предпочитаемый язык, чтобы продолжить. Мы хотим, чтобы у вас был лучший опыт! 😊 
    
    - English 🇬🇧 
    - Русский 🇷🇺 
    - Українська 🇺🇦

tiktok_videos_message_video_processing_success = 
    🎉 <b>Ваше видео готово!</b> 
    
    Вы использовали одно из своих <b>{$tiktokVideosBotLimit} бесплатных видео на сегодня.</b> 
    🎬 Наслаждайтесь вашим видео ниже! 🆓 
    
    Хотите больше? Откройте дополнительные видео с помощью Telegram Stars! 🌟

tiktok_videos_message_video_processing_error = 
    ❌ <b>К сожалению, мы не можем обработать ваше видео.</b> 
    
    Пожалуйста, попробуйте еще раз, пока мы расследуем эту проблему.

tiktok_videos_message_go_video = 🎥 <b>Время загрузки видео!</b> 
    
    📤 Вы можете отправить видео прямо сюда! 
    
    Помните, что вы можете загрузить файл размером до <b>50 МБ</b> через сообщения в Телеграме. 📱
    
    Но если ваше видео больше, не волнуйтесь! Вы можете загрузить файл размером до <b>1 ГБ</b> по ссылке и предоставить её нам. 🌐✨
    Просто нажмите на кнопку ниже и начните загружать! ⬇️

tiktok_videos_message_get_url_video_duration = 
    ⏳ <b>Получаем информацию о вашем видео!</b> 
    
    🎥 Мы анализируем загруженное видео по ссылке, чтобы узнать его длительность. Пожалуйста, подождите немного! ⚡
    Это может занять несколько секунд, и мы сообщим вам, как только всё будет готово! 🚀

tiktok_videos_message_payment_unknown = 
    ❓ <b>Неизвестный платеж!</b> 
    
    Мы получили поступление на баланс, но не можем определить, за что оно. 
    Пожалуйста, убедитесь, что вы используете правильный метод оплаты и введите необходимые данные. 💳
    
    Если у вас есть вопросы, не стесняйтесь обращаться за помощью! 💬

tiktok_videos_message_invoice_creation_error = 
    ❌ <b>Ошибка создания инвойса!</b> 
    
    Мы успешно отправили вам видео, но возникла проблема с созданием инвойса для оплаты. 💸
    
    Пожалуйста, попробуйте еще раз или свяжитесь с нами для получения помощи! 💬

    {$videoUrl}

tiktok_videos_donation_label = Поддержать бота

tiktok_videos_donation_title = Поддержи нашего бота! 🤖💖

tiktok_videos_donation_description = 
    Твоя помощь невероятно важна для нашего проекта! 🌟 
    
    Мы создаем бота с большой страстью и на данный момент находимся на ранней стадии развития. 💪💻

tiktok_videos_donation_thanks = 
    <b>Спасибо за поддержку!</b> 🙌❤️
    
    Твое пожертвование помогает нам <b>развивать нашего бота</b> и <b>улучшать его функциональность.</b>
    
    Мы <b>ценим твою помощь</b> и <b>enthusiasm!</b> 🚀💖

tiktok_videos_invoice_title = Услуга обработки видео

tiktok_videos_invoice_description = Наш бот проделал чудесную работу по обработке вашего видео! 🎉✨

tiktok_videos_invoice_product_label = Обработка видео

tiktok_videos_message_video_settings_split = 
    <b>🔧 Текущие настройки видео</b> 🎬
    
    <b>🌟 Общие настройки:</b>
    
    - <b>Тема фонового видео:</b> {$backdropTypeName}
    - <b>Шаблон редактора:</b> Split 📱⬆️⬇️
    - <b>Соотношение сторон:</b> {$ratioTop}% / {$ratioBottom} 📏⚖️
    - <b>Положение основного видео:</b> {$position}
    - <b>Длительность видео:</b> {$editorDuration} секунд ⏳
    
    <b>🔊 Настройки звука:</b>
    
    - <b>Громкость основного видео:</b> {$editorMainVideoVolume}% 🔊
    - <b>Громкость пользовательского аудио:</b> {$editorCustomAudioVolume}% 🎤
    - <b>Громкость фонового видео:</b> {$editorBackdropVideoVolume}% 🖼️

tiktok_videos_message_video_settings_popup = 
    <b>🔧 Текущие настройки видео</b> 🎬
    
    <b>🌟 Общие настройки:</b>
    
    - <b>Тема фонового видео:</b> {$backdropTypeName}
    - <b>Шаблон редактора:</b> Popup 📱⬆️⬇️
    - <b>Положение основного видео:</b> {$position}
    - <b>Длительность видео:</b> {$editorDuration} секунд ⏳
    
    <b>🔊 Настройки звука:</b>
    
    - <b>Громкость основного видео:</b> {$editorMainVideoVolume}% 🔊
    - <b>Громкость пользовательского аудио:</b> {$editorCustomAudioVolume}% 🎤
    - <b>Громкость фонового видео:</b> {$editorBackdropVideoVolume}% 🖼️

tiktok_videos_message_select_rolls_target=
    Вы загрузили короткое видео! Куда его разместить? 🎬
    
    - <b>В начало</b> (Pre-Roll) — Видео будет проигрываться перед основным контентом ⬆️
    - <b>В конец</b> (Post-Roll) — Видео появится после основного контента ⬇️

    Пожалуйста, выберите, где хотите его разместить!

tiktok_videos_message_ask_delete_roll = 
    <b>Удалить {$type}?</b>
    
    Этот ролик будет полностью удален из видео. Вы уверены, что хотите удалить его?

tiktok_videos_message_rolls_management = 
    <b>🎬 Управление Pre- и Post-Roll 🎬</b>
    
    Это короткие видео, которые добавляют изюминку в начале (<i>pre-roll</i> ⏪) или в конце (<i>post-roll</i> ⏩) вашего основного видео! 🎞️
    
    📩 Чтобы добавить, отправьте боту видео (до 10 секунд) и выберите, куда его разместить — в начало или конец! 🔝🔚

    📐 <i>Лучше использовать вертикальное видео (1080x1920) для наилучшего результата!</i> 📲

tiktok_videos_unpaid_invoice_found = 
    ❗️ <b>Вы исчерпали дневной лимит бесплатных видео и у вас есть неоплаченный счет за услуги бота.</b> 💰

    Пожалуйста, оплатите его, чтобы продолжить пользоваться нашими услугами! 💳

tiktok_videos_message_donation = 
    💖 <b>Хотите поддержать наш проект и помочь в развитии ботов?</b> 🚀

    Перейдите в @{$billingBotUsername}, чтобы сделать пожертвование и внести свой вклад в развитие! 🙌 Мы будем вам очень благодарны! 🌟

# ============================ VIDEO CAPTIONS ============================
video_captions_under_constructions = 
    🙌 Спасибо за ваш интерес к этому боту! 🚀 

    Мы уже на финишной прямой — бот почти готов. ⏳ Совсем скоро он начнёт работать для вас. 
    
    📅 Мы обязательно сообщим вам, как только он будет готов! 📢
