# Languages
language_ru = Російська
language_en = Англійська
language_uk = Українська

# Common buttons
button_back = Назад
button_cancel = Скасувати
button_close = Закрити
button_delete = Видалити
button_donation = Донат
button_download = Завантажити
button_about = Про проєкт
button_faq = Часті питання
button_support = Підтримка
button_limits = Ліміти
button_select_language = Вибір мови
button_subscription = Підписка
button_yes_delete = Так, видалити

shared_message_about = <b>💡 Про проект</b>

    Цей проект розвивається завдяки зусиллям програміста та підтримці професіоналів із різних сфер. Команда включає знайомих SMM-спеціалістів, відеомонтажерів та людей, які працюють в соцмережах, і вони активно використовують наших ботів, допомагаючи з порадами та покращеннями. 🤝

    Наші боти створені для вирішення різних завдань:

    - 🎶 <b>{$musicSearchBotUsername}</b> — Муз-бот для пошуку музики, щоб знаходити будь-які треки.
    
    - 📥 <b>{$downloaderBotUsername}</b> — Бот для завантаження медіа з соцмереж (Instagram, TikTok, YouTube) та месенджерів.
    
    - 🎬 <b>{$vttBotUsername}</b> — Бот для перетворення відео та аудіо в текст.
    
    - 🎨 <b>{$tiktokVideosBotUsername}</b> — Бот для створення креативних відео для TikTok.
    
    - 📝 <b>{$videoCaptionsBotUsername}</b> — Бот для сторітелінгу, який перетворює ваш текст в аудіо і накладає субтитри на відео.

    Кожен із нас робить свій внесок, щоб зробити ботів ще зручнішими та кориснішими для вас! 💡💬

shared_message_support = <b>🚨 Виникли труднощі?</b>

    Ми завжди раді допомогти вам! 😊 Якщо у вас виникли питання по роботі з ботами, складнощі або побажання — не вагайтеся писати нам! 💬

    Просто напишіть {$supportUsername}, і ми обов'язково вам допоможемо! 🤝💡


shared_message_language_settings = <b>🌍 Вибір мови</b>

    Оберіть мову, якою ви хочете спілкуватися з ботом. 
    Ми підтримуємо кілька мов, щоб забезпечити зручність для всіх користувачів.

    Просто оберіть потрібну мову, і я продовжу працювати з вами цією мовою! 🎉


shared_error_limits_reached = <b>😞 Ви досягли безкоштовного ліміту</b>

    На жаль, ви вичерпали свій безкоштовний ліміт на сьогодні і не маєте підписки.

    Щоб продовжити використовувати ботів без обмежень, оформіть підписку в боті {$billingBotUsername}.
    Підписка відкриє вам необмежений доступ до функціоналу ботів! 🎉


shared_message_subscription = <b>🎉 Підписка на ботів!</b>

    Підписка дає вам доступ одразу до трьох ботів на 30 днів! 🚀

    З підпискою ви отримуєте:
    - Доступ до бота для завантаження медіа з соціальних мереж (Instagram, TikTok, YouTube) без обмежень!
    - Доступ до бота для пошуку музики з Spotify без лімітів!
    - Доступ до бота для перетворення відео/аудіо в текст без обмежень!

    Тепер ви можете завантажувати відео та музику, шукати треки та перетворювати аудіо/відео в текст без обмежень і лімітів! 🎶📹✍️

    Підписка дозволить вам насолоджуватися повним функціоналом усіх ботів, без обмежень за кількістю завантажень, запитів та перетворень.

    Не пропустіть можливість — отримайте підписку та використовуйте ботів на повну потужність! 🎉

    Щоб оформити підписку, перейдіть у {$billingBotUsername} за посиланням і дотримуйтесь інструкцій.

# ============================ BILLING ============================
billing_button_ask_donation = 💖 Підтримати ботів
billing_button_ask_subscription = 📅 Оформити підписку

# Donation invoice
billing_donation_title = Підтримати розвиток ботів
billing_donation_label = Одноразова допомога
billing_donation_description = На каву та заспокійливе для розробників
billing_message_donation = <b>Допоможіть нам розвивати ботів!</b>

    Ці боти створені завдяки зусиллям команди розробників, які вкладають свою енергію та час у покращення функціоналу. 
    Ми постійно працюємо над новими можливостями, і ваша підтримка допомагає нам рухатися вперед. 
    
    Ваш донат дасть нам можливість покращити роботу ботів, додавати нові функції та забезпечити їх стабільність. 
    Кожна ваша допомога важлива для нас! 🙏💖

billing_donation_thanks = <b>Дякуємо за вашу допомогу!</b>

    Ваша підтримка надзвичайно важлива для нас, і ми вдячні за вклад у наш проєкт. 
    Кожне ваше пожертвування допомагає нам робити ботів кращими, швидшими та кориснішими.
    
    Завдяки вам ми зможемо додавати нові функції та покращувати роботу ботів! 🎉🙏

# Main messages and errors
billing_error_unknown_payment = <b>❗ Невідомий платіж</b>

    На жаль, ми не можемо обробити цей платіж, оскільки він не відповідає ні підписці, ні донату. 
    
    Будь ласка, зв'яжіться з підтримкою, щоб розібратися в ситуації. Ми обов'язково допоможемо вам! 🤔

billing_message_start = <b>👋 Вітаємо!</b>

    Цей бот відповідає за підписки на два наші сервіси:
    
    1. 🎶 <b>Муз-бот для пошуку музики</b> — шукайте і знаходьте будь-які музичні треки прямо тут!
    
    2. 📥 <b>Бот для завантаження медіа з соцмереж</b> — завантажуйте відео та аудіо прямо з популярних соцмереж і месенджерів.
    
    Підпишіться, щоб користуватися всіма функціями наших ботів!

# Subscription invoice
billing_subscription_description = Необмежений доступ до ботів проєкту на 30 днів
billing_subscription_label = Доступ до ботів
billing_subscription_title = Підписка на ботів
billing_message_subscription = <b>🔄 Підписка</b>

    Оформивши підписку, ви отримуєте доступ до всіх можливостей ботів на 30 днів, а також підтримуєте наш проєкт. 
    
    Оплата здійснюватиметься через Telegram Stars 🌟. 
    Завдяки вам ми можемо розвивати проєкт і додавати нові функції!

billing_subscription_thanks = <b>Дякуємо за підписку!</b>

    Тепер ви маєте доступ до всіх функцій наших ботів! 
    Ви підтримуєте розвиток проєкту, і ми щиро вдячні за вашу допомогу. 
    Разом ми зробимо наших ботів ще кращими! 🚀🎶📥

billing_message_faq = <b>❓ Часто задавані питання (FAQ)</b>

    <b>1. До яких ботів дає доступ підписка?</b>
    Підписка дає вам необмежений доступ до всіх ботів нашої команди, включаючи:
    - {$downloaderBotUsername} - Бот для завантаження медіа з соціальних мереж (Instagram, TikTok, YouTube).
    - {$musicSearchBotUsername} - Бот для пошуку музики.
    - {$vttBotUsername} - Бот для перетворення аудіо/відео в текст.

    <b>2. Скільки коштує підписка?</b>
    Вартість підписки — ⭐{$billingBotSubscriptionPrice} Telegram Stars за 30 днів з моменту оформлення.

    <b>3. Чи буде автоматично зніматися оплата?</b>
    Ні, оплата в Telegram не підтримує автоматичні списання. Однак, наш бот заздалегідь повідомить вас про дату завершення підписки, щоб ви могли продовжити її.

    <b>4. На які сервіси не поширюється підписка?</b>
    Підписка не дає доступ до наступних сервісів:
    - {$tiktokVideosBotUsername} - Бот для створення відео для TikTok.
    - {$videoCaptionsBotUsername} - Бот для сторітелінгу, який перетворює ваш текст в аудіо та накладає субтитри на різні відео.

    <b>5. Як дізнатися статус підписки?</b>
    Ви можете перевірити статус своєї підписки, написавши в {$billingBotUsername}, і бот надасть актуальну інформацію.


# ============================ DOWNLOADER ============================
downloader_button_go = Почати
downloader_error_no_info = <b>😕 Не вдалося знайти медіафайли</b>

    За наданим посиланням не вдалося знайти медіафайли для завантаження.
    Будь ласка, перевірте правильність посилання та спробуйте ще раз.

downloader_incorrect_social_link = <b>⚠️ Підтримувана соціальна мережа не знайдена</b>

    Ви надіслали посилання на сервіс, який не підтримується ботом.
    
    Будь ласка, надішліть посилання з Instagram, TikTok, YouTube або Spotify.

downloader_label_author = Автор
downloader_label_duration = Тривалість
downloader_label_quality = Якість
downloader_label_size = Розмір
downloader_label_source = Джерело
downloader_label_title = Опис
downloader_label_type = Тип медіа
downloader_label_url = Посилання

downloader_type_image = Зображення
downloader_type_video = Відео
downloader_type_audio = Аудіо

downloader_message_large_video = <b>🛑 Файл занадто великий</b>
    
    На жаль, файл занадто великий, і бот не може його надіслати.
    
    Використовуйте прямі посилання, які надав вам бот.

downloader_message_start = <b>👋 Привіт!</b>
    Цей бот дозволяє завантажувати відео з TikTok, Instagram, YouTube
    та музику з Spotify. Просто надішліть посилання на медіа, щоб почати завантаження!
    Насолоджуйтесь! 🎶📹

downloader_message_faq = <b>❓ Часто задавані питання (FAQ)</b>

    <b>1. Як почати завантаження?</b>
    Натисніть кнопку <b>🚀 Почати</b> та надішліть посилання на відео чи трек з Instagram, TikTok, YouTube або Spotify.

    <b>2. Чому бот не знайшов медіафайли?</b>
    Якщо бот повідомляє "<b>😕 Не вдалося знайти медіафайли</b>", перевірте, чи посилання веде на сторінку з медіафайлом, і спробуйте ще раз. Іноді формат посилання може бути непідходящим.

    <b>3. Чи підтримуються інші соціальні мережі?</b>
    Бот підтримує лише Instagram, TikTok, YouTube та Spotify. Якщо ви надішлете посилання з інших сервісів, з'явиться повідомлення "<b>⚠️ Підтримувана соціальна мережа не знайдена</b>".

    <b>4. Що робити, якщо файл занадто великий?</b>
    У разі, якщо бот не може надіслати файл, він відобразить повідомлення "<b>🛑 Файл занадто великий</b>". Перевірте, чи є у вас доступ до прямого посилання.

    <b>5. Яку інформацію про файл надає бот?</b>
    Бот може показати таку інформацію про файл:
    - <b>Автор</b> (якщо доступно)
    - <b>Тривалість</b> відео чи аудіо
    - <b>Якість</b> (роздільна здатність відео)
    - <b>Розмір</b> файлу
    - <b>Джерело</b> (Instagram, YouTube, TikTok або Spotify)
    - <b>Опис</b> та <b>Тип медіа</b>

    <b>6. Як зв'язатися з підтримкою?</b>
    Якщо у вас виникли питання чи труднощі, не соромтеся звертатися до підтримки. Ми завжди готові допомогти!

downloader_message_limits = <b>⏳ Обмеження на використання</b>

    Без підписки ви можете використовувати бота, але є ліміт — обробка до {$downloaderBotLimit} посилань на день. 

    Щоб зняти обмеження та насолоджуватись необмеженим доступом, оформіть підписку! 🎉

downloader_message_go = <b>📥 Надішліть посилання для завантаження</b>

    Щоб почати, просто надішліть посилання на відео з Instagram, TikTok, YouTube або пісню з Spotify. Бот обробить її та запропонує варіанти завантаження. 🚀

# ============================ MUSIC SEARCH ============================
music_search_button_go = Почати

music_search_error_sending_audio = <b>😕 Боту не вдалося надіслати аудіо</b>
    На жаль, сталася помилка при надсиланні треку. Будь ласка, спробуйте ще раз пізніше.

music_search_message_sending_audio = <b>🎶 Бот розпочав надсилання треку...</b>
    Ваш трек вже надсилається! Будь ласка, зачекайте кілька хвилин.

music_search_message_start = <b>👋 Привіт!</b>
    Я — ваш надійний помічник у світі музики! 🎧
    Я допоможу вам знайти та завантажити вашу улюблену музику.
    Просто надішліть назву треку або ім'я виконавця, і я почну пошук!

music_search_message_tracks_not_found = <b>:( Ой, нічого не знайдено</b>
    На жаль, я не зміг знайти трек за вашим запитом. Спробуйте ввести назву або ім'я виконавця ще раз.

music_search_message_tracks_result = <b>🎉 Ура! Ось що я знайшов!</b>
    Я знайшов кілька треків за вашим запитом. Насолоджуйтесь прослуховуванням!

music_search_message_faq = <b>❓ Часто задавані питання (FAQ)</b>

    <b>1. Як почати пошук музики?</b>
    Просто надішліть назву треку або ім'я виконавця, і я почну пошук для вас.

    <b>2. Що робити, якщо я не можу знайти трек?</b>
    Якщо я не зміг знайти трек, можливо, запит не зовсім точний. Спробуйте змінити назву або виконавця і спробуйте знову.

    <b>3. Скільки треків я можу шукати на день?</b>
    Без підписки ви можете шукати лише {$musicSearchBotLimit} треки на день. Для необмеженого пошуку оформіть підписку!

music_search_message_limits = <b>⏳ Обмеження на використання</b>

    Без підписки ви можете скористатися ботом лише {$musicSearchBotLimit} разів на день ({$musicSearchBotLimit} пошуків).
    
    Якщо вам потрібно більше, оформіть підписку та насолоджуйтесь необмеженим доступом до музики! 🎶

music_search_message_go = <b>🔍 Надішліть назву треку або ім'я виконавця</b>
    Щоб почати, просто надішліть назву пісні або ім'я виконавця, і я почну пошук! 🎵

music_search_bot_start_search = 
    🔍 <b>Бот розпочав пошук треків!</b> 🎶 
    
    Ми надішлемо їх вам, як тільки знайдемо! ⏳

# ============================ VTT ============================
vtt_button_go = Почати

vtt_message_fetching_audio = <b>📥 Ми отримали ваше відео!</b>
    Тепер витягуємо аудіо для перетворення в текст. Будь ласка, зачекайте.

vtt_message_processing_audio = <b>🎧 Перетворюємо аудіо в текст...</b>
    Бот почав процес перетворення аудіо в текст. Скоро ви отримаєте результат!

vtt_message_start = <b>👋 Привіт!</b>
    Я — бот для перетворення аудіо та відео в текст! 🎤🎬

    Ви можете надіслати мені:
    - Відео файл
    - Аудіо файл
    - Голосове повідомлення
    - Відео-повідомлення (кружок / video note)

    Я витягну текст з цих файлів і надішлю вам результат!

vtt_message_faq = <b>❓ Часто задавані питання (FAQ)</b>
    
    <b>1. Як надіслати файл для перетворення в текст?</b>
    Просто надішліть мені відео, аудіо файл або голосове/відео повідомлення, і я почну процес перетворення.

    <b>2. Скільки часу займає перетворення?</b>
    Зазвичай це займає лише кілька секунд! ⏱️

    <b>3. Які обмеження на використання?</b>
    Без підписки ви можете обробити лише {$vttBotLimit} файли на день. Для безмежного доступу оформіть підписку!

vtt_message_limits = <b>⏳ Обмеження на використання</b>
    Без підписки ви можете обробляти лише {$vttBotLimit} файли на день (треки або відео). 
    Оформіть підписку та отримайте безмежний доступ до всіх можливостей бота та інших ботів!

vtt_message_go = <b>🔊 Надішліть аудіо, відео або запишіть голосове/відео повідомлення</b>
    Для початку надішліть мені файл або записуйте повідомлення, і я перетворю його на текст! 🎙️

vtt_error_processing = <b>😞 Помилка обробки файлу</b>

    На жаль, не вдалося обробити завантажений файл. 
    
    Ми повідомили розробників, і вони вже працюють над вирішенням проблеми. 
    Будь ласка, спробуйте знову пізніше.

# ============================ TIKTOK VIDEOS ============================
tiktok_videos_button_process_video = Обробити
tiktok_videos_button_back_editor = Назад до редактора
tiktok_videos_button_template = Шаблон
tiktok_videos_button_backdrop = Тло
tiktok_videos_button_sound_settings = Звук
tiktok_videos_button_position = Позиція
tiktok_videos_button_ratio = Співвідношення
tiktok_videos_button_upload_large_video = Завантажити
tiktok_videos_button_go = Редагувати
tiktok_videos_button_close_editor = Закрити редактор
tiktok_videos_button_template_split = Split
tiktok_videos_button_template_popup = Popup
tiktok_videos_button_open_result_video = Відкрити відео

tiktok_videos_position_top = Зверху
tiktok_videos_position_center = По центру
tiktok_videos_position_bottom = Знизу

tiktok_videos_error_no_editor =
    ❌ Редактор не відкритий.
    Будь ласка, завантажте відео, щоб почати.
tiktok_videos_error_audio_long_duration =
    🚫 Помилка: аудіо занадто довге.
    Завантажте файл меншої тривалості.
tiktok_videos_error_opened_editor =
    ⚠️ Редактор вже відкритий.
    Завершіть поточний процес редагування або закрийте редактор.
tiktok_videos_error_video_duration =
    ⏰ Помилка: тривалість відео некоректна.
    Перевірте тривалість і спробуйте знову.
tiktok_videos_error_file_too_big =
    📁 Файл занадто великий.
    Будь ласка, завантажте файл меншого розміру.
tiktok_videos_error_file_upload_error =
    ❗ Помилка завантаження файлу.
    Спробуйте завантажити файл ще раз.
tiktok_videos_error_url_host =
    🌐 Помилка посилання: дозволені лише посилання із серверів бота.
tiktok_videos_error_photo_not_implemented =
    🖼️ Фотографії не підтримуються.
    Завантаження фотографій для обробки поки що недоступне.
tiktok_videos_error_no_backdrop_video =
    🎥 Фонове відео не вибрано.
    Виберіть фонове відео для продовження.
tiktok_videos_error_video_url =
    🔗 Відео за вказаним URL не знайдено.
    Перевірте адресу і спробуйте знову.

tiktok_videos_message_start=
    <b>Ласкаво просимо до TgTok</b> — твій особистий помічник для створення крутих TikTok відео! 🎬🔥

    Тут ти можеш легко створити відео з двома шаблонами на вибір:
    - <b>Split view</b> — екран розділений на дві частини 📱⬆️⬇️.
    - <b>Popup</b> — основне відео по центру з фоном позаду 🎥✨.
    
    <b>Як почати:</b>
    1. Завантаж своє відео 🎥.
    2. Обери шаблон: Split view або Popup 📊.
    3. Визнач тему для фону: Minecraft 🏰, GTA Parkour 🚗💥, Приготування їжі 🍳 або Прибирання/очищення килимів 🧹🧼.
    4. Налаштуй відео ⚙️ - додай власне аудіо, додаткове відео, співвідношення сторін.
    5. Отримай готове відео за кілька кліків і насолоджуйся результатом! 🎉🚀
    Якщо щось незрозуміло — завжди пиши /help. <b>Я тут, щоб допомогти!</b> 😉

tiktok_videos_message_faq=
    🤔 <b>Що таке TgTok?</b>
    TgTok — це твій особистий помічник для створення дивовижних TikTok відео! 🎬✨
    З нашим ботом ти можеш легко завантажувати відео, обирати шаблони та налаштовувати свій контент. 🚀
    
    💰 <b>Скільки безкоштовних відео я можу створити?</b>
    Ти можеш створювати до <b>{$tiktokVideosBotLimit} відео щодня безкоштовно!</b> 🎉
    Після цього можна придбати додаткові відео залежно від їх тривалості лише за <b>{$tiktokVideosBotPricePerMinute} зірок Telegram за хвилину.</b> ⭐
    
    🎥 <b>Які шаблони доступні?</b>
    Ми пропонуємо два цікаві шаблони: <b>Split view</b> (розділений екран) 📱⬆️⬇️ і <b>Popup</b> (основне відео з фоном) 🎥✨.
    Обирай той, який підходить тобі!
    
    🔊 <b>Чи можу я додати своє аудіо?</b>
    Абсолютно! Ти можеш завантажити своє аудіо і налаштувати гучність для своїх відео. 🎧
    Зроби свої творіння по-справжньому унікальними! 🎵
    
    ⏳ <b>Скільки часу займає обробка відео?</b>
    Обробка відео відбувається в режимі реального часу! ⏱️
    Ти отримаєш оновлення про прогрес, і твоє відео буде готове незабаром. 🚀

tiktok_videos_message_editor_ratio=
    <b>Налаштування співвідношення сторін відео</b> ⚙️
    
    Ви відкрили налаштування співвідношення сторін для основного відео та фонового відео! Тут ви можете налаштувати розміри між двома відео:
    
    1. <b>50% / 50%</b> 📏⚖️: Однакові розміри для основного відео і фону, створюючи збалансований вигляд.
    2. <b>25% / 75%</b> 📏📽️: Основне відео займає меншу частину, тоді як фонове домінує на екрані.
    3. <b>75% / 25%</b> 📏🎥: Основне відео більше, що забезпечує помітніше відображення на фоні меншого відео.
    
    Оберіть бажане співвідношення для налаштування макету вашого відео!

tiktok_videos_message_editor_backdrop=
    <b>Обери тему фонового відео</b>:
    
    - <b>Minecraft</b> 🏰
    - <b>GTA Parkour</b> 🚗💥
    - <b>Приготування їжі</b> 🍳
    - <b>Прибирання/очищення килимів</b> 🧹🧼

tiktok_videos_message_editor_sound_settings=
    <b>Налаштування аудіо</b> 🎧 
    Налаштуйте <b>гучність кожного елемента відео</b> за вашим смаком:

    1. <b>Гучність головного відео</b> 📽️: {$editorMainVideoVolume}% 
    2. <b>Гучність фонового відео</b> 🖼️: {$editorBackdropVideoVolume}% 
    3. <b>Гучність користувацького аудіо</b> 🎤: {$editorCustomAudioVolume}% 

    Використовуйте <b>повзунки</b> для точного налаштування звуку, щоб усе звучало <b>ідеально</b>! 🎛️

tiktok_videos_message_editor_vertical_position=
    <b>Налаштування положення відео</b> ⚙️

    Ви відкрили налаштування <b>положення основного відео</b>! Тут ви можете обрати, де хочете розмістити основне відео у своєму проекті.

    1. <b>Зверху</b> 📱⬆️: Розмістіть основне відео у верхній частині екрана для <b>яскравішого відображення</b>.

    2. <b>Посередині</b> 📱🎯: Розмістіть основне відео в центрі для <b>збалансованого вигляду</b>.
    <i>Ця опція недоступна в режимі Split view!</i>

    3. <b>Знизу</b> 📱⬇️: Розмістіть основне відео внизу, щоб зробити акцент на фоні.

    Оберіть бажаний варіант, щоб <b>налаштувати макет вашого відео</b>!

tiktok_videos_message_editor_templates_info = 
    <b>Вибери шаблон, який тобі більше подобається:</b> 

    - <b>Split view</b> — розділення екрану на дві частини 📱⬆️⬇️.

    - <b>Popup</b> — основне відео по центру з фоном на задньому плані 🎥✨.

    Натисни одну з кнопок нижче, щоб продовжити! ⬇️

tiktok_videos_message_limits = 
    <b>💼 Щоденна квота:</b> 

    Ти можеш безкоштовно створювати до <b>{$tiktokVideosBotLimit} відео на день</b> — чудовий спосіб почати! 🆓✨

    Після цього за кожне наступне відео стягується плата <b>{$tiktokVideosBotPricePerMinute} Telegram Stars</b> 🌟 за хвилину відео ⏱ (мінімальна плата — <b>{$tiktokVideosBotPricePerMinute} зірок</b>).

    Чим більше створюєш, тим більше можна ділитися! 😎

tiktok_videos_message_video_processing_progress = 
    ⏳ <b>Ваше відео обробляється!</b> 🎬
    Ми додаємо останні штрихи, щоб зробити його ідеальним! 🔧

    <b>Поточний прогрес:</b> {$progress}% 🔄

    Будь ласка, зачекайте, це може зайняти деякий час... ⚡

    Ви отримаєте сповіщення, як тільки воно буде готове! 🎉

tiktok_videos_message_start_video_processing = 
    ⚙️ <b>Ваше відео в черзі!</b> 🎬
    Наша система обробляє все автоматично в реальному часі.
    Не хвилюйтесь, ми будемо тримати вас у курсі! ⏳

    Розслабтесь і дайте магії здійснитися! ✨

tiktok_videos_message_paid_video_result = 
    🎉 <b>Велике спасибі за оплату!</b> 🥳

    Ваше відео успішно оброблене і готове до використання! 📹✨

    Воно доступне за посиланням нижче — можете ділитися з друзями або використовувати на свій розсуд! 😎
    Якщо потрібна допомога, ми завжди поруч! 💬

tiktok_videos_message_language_settings = 
    🌍 <b>Виберіть мову</b> 🌐

    Будь ласка, виберіть бажану мову, щоб продовжити. Ми хочемо, щоб у вас був найкращий досвід! 😊

    - English 🇬🇧
    - Русский 🇷🇺
    - Українська 🇺🇦

tiktok_videos_message_video_processing_success = 
    🎉 <b>Ваше відео готове!</b>

    Ви використали одне з ваших <b>{$tiktokVideosBotLimit} безкоштовних відео на сьогодні.</b>
    🎬 Насолоджуйтесь вашим відео нижче! 🆓

    Хочете більше? Відкрийте додаткові відео за допомогою Telegram Stars! 🌟

tiktok_videos_message_video_processing_error = 
    ❌ <b>На жаль, ми не можемо обробити ваше відео.</b>

    Будь ласка, спробуйте ще раз, поки ми розслідуємо цю проблему.

tiktok_videos_message_go_video = 
    🎥 <b>Час завантажити відео!</b>

    📤 Ви можете надіслати відео прямо сюди!

    Пам'ятайте, що ви можете завантажити файл розміром до <b>50 МБ</b> через повідомлення в Телеграмі. 📱

    Але якщо ваше відео більше, не хвилюйтесь! Ви можете завантажити файл розміром до <b>1 ГБ</b> за посиланням і надати його нам. 🌐✨
    Просто натисніть на кнопку нижче і почніть завантаження! ⬇️

tiktok_videos_message_get_url_video_duration = 
    ⏳ <b>Отримуємо інформацію про ваше відео!</b>

    🎥 Ми аналізуємо завантажене відео за посиланням, щоб дізнатися його тривалість. Будь ласка, зачекайте трохи! ⚡
    Це може зайняти кілька секунд, і ми повідомимо вам, як тільки все буде готово! 🚀

tiktok_videos_message_payment_unknown = 
    ❓ <b>Невідомий платіж!</b>

    Ми отримали надходження на баланс, але не можемо визначити, за що воно.
    Будь ласка, переконайтесь, що ви використовуєте правильний метод оплати та введіть необхідні дані. 💳

    Якщо у вас є питання, не соромтеся звертатися за допомогою! 💬

tiktok_videos_message_invoice_creation_error = 
    ❌ <b>Помилка створення рахунку!</b>

    Ми успішно надіслали вам відео, але виникла проблема зі створенням рахунку для оплати. 💸

    Будь ласка, спробуйте ще раз або зв'яжіться з нами для отримання допомоги! 💬

    {$videoUrl}

tiktok_videos_donation_label = Підтримати бота

tiktok_videos_donation_title = Підтримай нашого бота! 🤖💖

tiktok_videos_donation_description = 
    Твоя допомога неймовірно важлива для нашого проєкту! 🌟

    Ми створюємо бота з великою пристрастю і на даний момент знаходимося на ранній стадії розвитку. 💪💻

tiktok_videos_donation_thanks = 
    <b>Дякуємо за підтримку!</b> 🙌❤️

    Твоє пожертвування допомагає нам <b>розвивати нашого бота</b> і <b>покращувати його функціональність.</b>

    Ми <b>цінуємо твою допомогу</b> і <b>ентузіазм!</b> 🚀💖

tiktok_videos_invoice_title = Послуга обробки відео

tiktok_videos_invoice_description = Наш бот чудово впорався з обробкою вашого відео! 🎉✨

tiktok_videos_invoice_product_label = Обробка відео

tiktok_videos_message_video_settings_split = 
    <b>🔧 Поточні налаштування відео</b> 🎬

    <b>🌟 Загальні налаштування:</b>

    - <b>Тема фонового відео:</b> {$backdropTypeName}
    - <b>Шаблон редактора:</b> Split 📱⬆️⬇️
    - <b>Співвідношення сторін:</b> {$ratioTop}% / {$ratioBottom} 📏⚖️
    - <b>Положення основного відео:</b> {$position}
    - <b>Тривалість відео:</b> {$editorDuration} секунд ⏳

    <b>🔊 Налаштування звуку:</b>

    - <b>Гучність основного відео:</b> {$editorMainVideoVolume}% 🔊
    - <b>Гучність користувацького аудіо:</b> {$editorCustomAudioVolume}% 🎤
    - <b>Гучність фонового відео:</b> {$editorBackdropVideoVolume}% 🖼️

tiktok_videos_message_video_settings_popup = 
    <b>🔧 Поточні налаштування відео</b> 🎬

    <b>🌟 Загальні налаштування:</b>

    - <b>Тема фонового відео:</b> {$backdropTypeName}
    - <b>Шаблон редактора:</b> Popup 📱⬆️⬇️
    - <b>Положення основного відео:</b> {$position}
    - <b>Тривалість відео:</b> {$editorDuration} секунд ⏳

    <b>🔊 Налаштування звуку:</b>

    - <b>Гучність основного відео:</b> {$editorMainVideoVolume}% 🔊
    - <b>Гучність користувацького аудіо:</b> {$editorCustomAudioVolume}% 🎤
    - <b>Гучність фонового відео:</b> {$editorBackdropVideoVolume}% 🖼️

tiktok_videos_message_select_rolls_target = 
    Ви завантажили коротке відео! Куди його розмістити? 🎬

    - <b>На початок</b> (Pre-Roll) — відео буде відтворюватися перед основним контентом ⬆️
    - <b>В кінець</b> (Post-Roll) — відео з'явиться після основного контенту ⬇️

    Будь ласка, виберіть, де ви хочете його розмістити!

tiktok_videos_message_ask_delete_roll = 
    <b>Видалити {$type}?</b>
    
    Це відео буде повністю видалено з основного відео. Ви впевнені, що хочете його видалити?

tiktok_videos_message_rolls_management = 
    <b>🎬 Керування Pre- і Post-Roll 🎬</b>
    
    Це короткі відео, які додають родзинку на початку (<i>pre-roll</i> ⏪) або в кінці (<i>post-roll</i> ⏩) вашого основного відео! 🎞️
    
    📩 Щоб додати, надішліть боту відео (до 10 секунд) і виберіть, де його розмістити — на початку чи в кінці! 🔝🔚

    📐 <i>Краще використовувати вертикальне відео (1080x1920) для найкращого результату!</i> 📲

tiktok_videos_unpaid_invoice_found = 
    ❗️ <b>Ви вичерпали денний ліміт безкоштовних відео, і у вас є неоплачений рахунок за послуги бота.</b> 💰

    Будь ласка, оплатіть його, щоб продовжити користуватися нашими послугами! 💳

tiktok_videos_message_donation = 
    💖 <b>Бажаєте підтримати наш проєкт та допомогти у розвитку ботів?</b> 🚀

    Перейдіть до @{$billingBotUsername}, щоб зробити донат та зробити свій внесок у розвиток! 🙌 Ми будемо вам дуже вдячні! 🌟

# ============================ VIDEO CAPTIONS ============================
video_captions_under_constructions = 
    🙌 Дякуємо за вашу зацікавленість у цьому боті! 🚀 

    Ми на фінішній прямій — бот майже готовий. ⏳ Незабаром він почне працювати для вас. 
    
    📅 Ми обов'язково повідомимо вам, щойно він буде готовий! 📢
